import React from 'react'
import { Link } from 'react-router-dom'
export default function Chatthpuja() {
  return (
    <div>
      

      <center>  <h1 style={{color:"white"}}>छठ पर्व</h1></center>

      <div class="container text-center">
  <div class="row">
    <div class="col">
    <center> <img src="chhath6.jpeg" className='img-thumbnail' alt="..."  style={{ height:'12rem'}}/></center>
    </div>
    <div class="col">
    <center> <img src="chatth.webp" className='img-thumbnail' alt="..."  style={{height:'12rem'}}/></center>
    </div>
    <div class="col">
    <center> <img src="chhath4.jpeg" className='img-thumbnail' alt="..."  style={{height:'12rem'}}/></center>
    </div>
  </div>
</div>

<div class="container text-center">
  <div class="row">
    <div class="col">
    <center> <img src="chhath3.jpeg" className='img-thumbnail' alt="..."  style={{marginBottom:"2rem",marginTop:'1rem',boxShadow:'1px 1px 2px white, 0 0 25px #149914, 0 0 5px #149914',height:'12rem'}}/></center>
    </div>
    <div class="col">
    <center> <img src="chhath2.jpeg" className='img-thumbnail' alt="..."  style={{marginBottom:"2rem",marginTop:'1rem',boxShadow:'1px 1px 2px white, 0 0 25px #149914, 0 0 5px #149914',height:'12rem'}}/></center>
    </div>
    <div class="col">
    <center> <img src="chhath8.jpeg" className='img-thumbnail' alt="..."  style={{marginBottom:"2rem",marginTop:'1rem',height:'12rem',boxShadow:'1px 1px 2px white, 0 0 25px #149914, 0 0 5px #149914',height:'12rem'}}/></center>
    </div>
  </div>
</div>
    

      <p id="para12" style={{color:"white",marginLeft:'1rem',marginRight:'1rem'}}>
      छठ पर्व, छइठ या षष्‍ठी पूजा[5] कार्तिक शुक्ल पक्ष के षष्ठी को मनाया जाने वाला एक हिन्दू पर्व है।[6][7] सूर्योपासना का यह अनुपम लोकपर्व मुख्य रूप से बिहार, झारखण्ड, पश्चिम बंगाल, पूर्वी उत्तर प्रदेश और नेपाल के तराई क्षेत्रों में मनाया जाता है। कहा जाता है यह पर्व मैथिल,मगध और भोजपुरी लोगो का सबसे बड़ा पर्व है ये उनकी संस्कृति है। छठ पर्व बिहार मे बड़े धुम धाम से मनाया जाता है। ये एक मात्र ही बिहार या पूरे भारत का ऐसा पर्व है जो वैदिक काल से चला आ रहा है और ये बिहार कि संस्कृति बन चुका हैं। यहा पर्व बिहार कि वैदिक आर्य संस्कृति कि एक छोटी सी झलक दिखाता हैं। ये पर्व मुख्यः रुप से ॠषियो द्वारा लिखी गई ऋग्वेद मे सूर्य पूजन, उषा पूजन और आर्य परंपरा के अनुसार बिहार मे यहा पर्व मनाया जाता हैं।

बिहार मे हिन्दुओं द्वारा मनाये जाने वाले इस पर्व को इस्लाम सहित अन्य धर्मावलम्बी भी मनाते देखे जाते हैं।[8][9] धीरे-धीरे यह त्योहार प्रवासी भारतीयों के साथ-साथ विश्वभर में प्रचलित हो गया है।[10] छठ पूजा सूर्य, प्रकृति,जल, वायु और उनकी बहन छठी म‌इया को समर्पित है ताकि उन्हें पृथ्वी पर जीवन की देवतायों को बहाल करने के लिए धन्यवाद, छठी मैया, जिसे मिथिला में रनबे माय भी कहा जाता है,[11] [12] भोजपुरी में सबिता माई और बंगाली में रनबे ठाकुर बुलाया जाता है। पार्वती का छठा रूप भगवान सूर्य की बहन छठी मैया को त्योहार की देवी के रूप में पूजा जाता है। यह चंद्र के छठे दिन काली पूजा के छह दिन बाद छठ मनाया जाता है। मिथिला में छठ के दौरान मैथिल महिलाएं, मिथिला की शुद्ध पारंपरिक संस्कृति को दर्शाने के लिए बिना सिलाई के शुद्ध सूती धोती पहनती हैं। [13]

त्यौहार के अनुष्ठान कठोर हैं और चार दिनों की अवधि में मनाए जाते हैं। इनमें पवित्र स्नान, उपवास और पीने के पानी (वृत्ता) से दूर रहना, लंबे समय तक पानी में खड़ा होना, और प्रसाद (प्रार्थना प्रसाद) और अर्घ्य देना शामिल है। परवातिन नामक मुख्य उपासक (संस्कृत पार्व से, जिसका मतलब 'अवसर' या 'त्यौहार') आमतौर पर महिलाएं होती हैं। हालांकि, बड़ी संख्या में पुरुष इस उत्सव का भी पालन करते हैं क्योंकि छठ लिंग-विशिष्ट त्यौहार नहीं है। छठ महापर्व के व्रत को स्त्री - पुरुष - बुढ़े - जवान सभी लोग करते हैं। [14] कुछ भक्त नदी के किनारों के लिए सिर के रूप में एक प्रोस्टेशन मार्च भी करते हैं।

पर्यावरणविदों का दावा है कि छठ[15] सबसे पर्यावरण-अनुकूल हिंदू त्यौहार है।[16][17] यह त्यौहार नेपाली और भारतीय लोगों द्वारा अपने डायस्पोरा के साथ मनाया जाता है।
      </p>
      <center><Link to="/BiharTourismHome"  class="btn btn-danger">Go-To-Home</Link></center>
      
    </div>
  )
}
